app/Controllers/Auth.php

	public function login(){
		if($this->request->getPost())
		{
			//lakukan validasi untuk data yang di post
			$data = $this->request->getPost();
			$validate = $this->validation->run($data, 'login');
			$errors = $this->validation->getErrors();

			if($errors)
			{
				return view('login');
			}

			$userModel = new \App\Models\UserModel();

			$username = $this->request->getPost('username');
			$password = $this->request->getPost('password');

			$user = $userModel->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'AMBORSIACLINIC'
 LIMIT 1