app/Controllers/Etalase.php

SELECT *
FROM `barang`
---
    public function index()
    {
        $barang = new \App\Models\BarangModel();
        $model = $barang->findAll();