app/Controllers/Transaksi.php

    public function index()
    {
        $transaksiModel = new \App\Models\TransaksiModel();
        $model = $transaksiModel->findAll();
---
SELECT *
FROM `transaksi`

    public function confirmpayment($id_transaksi = null)
    {
        // Verifikasi apakah pengguna adalah admin
        if (session()->get('role') !== 'admin') {
            // Jika bukan admin, redirect ke halaman home
            return redirect()->to(base_url('home/index'));
        }

        // Ambil data transaksi berdasarkan id_transaksi
        $transaksiModel = new TransaksiModel();
        $transaksi = $transaksiModel->where('id', $id_transaksi)->first();
---
SELECT *
FROM `transaksi`
WHERE `id` IS NULL
 LIMIT 1