app/Controllers/User.php

SELECT *
FROM `user`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function index()
    {
        // Fetch users with pagination
        $users = $this->userModel->paginate(10);