app/Models/NotificationModel.php

    public function getNotificationsByUser($id_user)
    {
        return $this->where('id_user', $id_user)->orderBy('created_at', 'desc')->findAll();
---
SELECT *
FROM `notification`
WHERE `id_user` IS NULL
ORDER BY `created_at` DESC